rotten-mongoose/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY "movies"."updated_at" DESC
---
  def poll_movies
    @movies = Movie.all.order(updated_at: :desc)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 1]]
---
  def show
    @user ||= User.new
    @user_action = 'new'
    @movie = Movie.find(params[:id])
    @movie_action = 'edit'

    @actor = @movie.actors.build
    @actor.roles.build

    @review = @movie.reviews.build
    @reviews = Movie.find(params[:id]).reviews