rotten-mongoose/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @movie = Movie.new
    @movie_action = 'new'
    @user = User.find(params[:id])