rotten-mongoose/app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]
---
    <p>email: <%= @user.email %></p>
    <p>Number of movies reviewed: <%= @user.reviews.count %></p>